# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [ ]:
# import libraries here

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [5]:
# your code here
import pandas as pd

employees = pd.read_csv('C:/Users/diana/Documents/Repos/GitHub/subsetting-and-descriptive-stats/your-code/Employee.csv')
employees.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

#### Explore the data types of the `employees` dataframe. Comment your results.

In [78]:
# your code here

data_types =employees.dtypes
print(data_types)

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [79]:
"""
your comments here

The categorical columns (Name, Department, Education, Gender, Title) are appropriately assigned the "object" data type.
Years, Salary: These columns are numerical, and the "int64" data type is suitable to represent integer values.
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [182]:
# your code here

average_salary = employees["Salary"].mean()
print(f'The avarage salary in this company is: {average_salary}')

The avarage salary in this company is: 48.888888888888886

#### What's the highest salary?

In [282]:
# your code here

highest_salary  = employees["Salary"].max()
print(f'The highest salary in this company is: {highest_salary }')

The highest salary in this company is: 70

#### What's the lowest salary?

In [315]:
# your code here
salary_statistics = employees.describe()
print(salary_statistics)

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Who are the employees with the lowest salary?

In [347]:
# your code here
lowest_salary_employees = employees[employees['Salary'] == employees['Salary'].min()]
lowest_salary_employees

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [378]:
# your code here

employee_david = employees[employees['Name']== 'David']
employee_david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [408]:
# your code here
employee_david = employees[employees['Name']== 'David']
employee_david

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Print all the rows where job title is associate.

In [437]:
# your code here

associantes = employees[employees['Title'] == 'associate']
associantes

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [465]:
# Method 1
# your code here

employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [492]:
# Method 2
# your code here

employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [518]:
# your code here

associante_above_55 = employees[(employees['Title'] == 'associate') & (employees['Salary'] >55) ]
associante_above_55

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [543]:
# your code here

grouped_by_years = employees.groupby('Years')['Salary'].mean()
grouped_by_years

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [567]:
# your code here
grouped_by_title = employees.groupby('Title')['Salary'].mean()
grouped_by_title

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [590]:
# your code here

salary_quartiles = employees['Salary'].quantile([0.25, 0.5, 0.75])
print(salary_quartiles)

0.25    35.0
0.50    55.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [612]:
# your code here
grouped_by_gender = employees.groupby('Gender')['Salary'].mean()
grouped_by_gender

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [633]:
# your code here

department_stats = employees.groupby('Department').agg({
    'Years': ['min', 'mean', 'max'],
    'Salary': ['min', 'mean', 'max']
})

print(department_stats)

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [653]:
# your code here
calculate_salary_difference = lambda x: x.max() - x.min()
department_salary_difference = employees.groupby('Department')['Salary'].agg(calculate_salary_difference)
print(department_salary_difference)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [654]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [655]:
# your code here

In [656]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [657]:
# your code here

#### What are the highest and lowest purchase prices?

In [658]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [659]:
# your code here

#### How many customers do we have in Spain?

In [660]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [661]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [662]:
# your code here

#### Select all free orders.

In [663]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [664]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [665]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [666]:
# your code here

#### Select all orders made in the month of August.

In [667]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [668]:
# your code here

#### What's the  average amount of money spent by country?

In [669]:
# your code here

#### What's the most expensive item?

In [670]:
# your code here

#### What is the average amount spent per year?

In [671]:
# your code here